In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt 
import seaborn

### read data and pickle it all

In [2]:
def read_data():
    data = pd.read_csv('/home/data-sci/Desktop/analysis/course/nesarc_pds.csv',low_memory=False)
#     data.rename(columns={'S1Q4A': 'age_afm','S1Q2J':'age','S1Q6A': 'edu'}, inplace=True)
                          
    return data

In [3]:
def pickle_data(data):
    data.to_pickle('cleaned_data.pickle')


def get_pickle():
    return pd.read_pickle('cleaned_data.pickle')

In [4]:
def the_data():
    """this function will check for the pickle file if not fond
    it will read the csv file then pickle it  """
    if os.path.isfile('cleaned_data.pickle'):
        data = get_pickle()

    else:
        data = read_data()
        pickle_data(data)
    return data

In [5]:
data = the_data()

In [6]:
data.shape

(43093, 3008)

In [7]:
data.head()

,ETHRACE2A,ETOTLCA2,IDNUM,PSU,STRATUM,WEIGHT,CDAY,CMON,CYEAR,REGION,...,SOL12ABDEP,SOLP12ABDEP,HAL12ABDEP,HALP12ABDEP,MAR12ABDEP,MARP12ABDEP,HER12ABDEP,HERP12ABDEP,OTHB12ABDEP,OTHBP12ABDEP
0,5,,1,4007,403,3928.613505,14,8,2001,4,...,0,0,0,0,0,0,0,0,0,0
1,5,0.0014,2,6045,604,3638.691845,12,1,2002,4,...,0,0,0,0,0,0,0,0,0,0
2,5,,3,12042,1218,5779.032025,23,11,2001,3,...,0,0,0,0,0,0,0,0,0,0
3,5,,4,17099,1704,1071.754303,9,9,2001,2,...,0,0,0,0,0,0,0,0,0,0
4,2,,5,17099,1704,4986.952377,18,10,2001,2,...,0,0,0,0,0,0,0,0,0,0

In [8]:
data2 = data[['MARITAL','S1Q4A','AGE','S1Q1C','S1Q1D1','S1Q1D2','S1Q1D3','S1Q1D4','S1Q1D5','S1Q4B','S1Q6A']]

In [9]:
data2.head()

,MARITAL,S1Q4A,AGE,S1Q1C,S1Q1D1,S1Q1D2,S1Q1D3,S1Q1D4,S1Q1D5,S1Q4B,S1Q6A
0,6,,23,1,2,2,2,2,1,,8
1,1,23,28,1,2,2,2,2,1,,8
2,3,35,81,1,2,2,2,2,1,2,6
3,6,,18,1,2,2,2,2,1,,8
4,1,22,36,2,2,2,1,2,2,,12

In [10]:
data2 = data2.rename(columns={'MARITAL':'marital','S1Q4A':'age_1st_mar',
                      'AGE':'age','S1Q1C':'hispanich','S1Q1D1':'indian','S1Q1D2':'asian','S1Q1D3':'black','S1Q1D4':'HAWAIIAN','S1Q1D5':'WHITE','S1Q4B':'how_mar_ended','S1Q6A':'edu'})

In [11]:
data2.shape

(43093, 11)

In [12]:
data2.head()

,marital,age_1st_mar,age,hispanich,indian,asian,black,HAWAIIAN,WHITE,how_mar_ended,edu
0,6,,23,1,2,2,2,2,1,,8
1,1,23,28,1,2,2,2,2,1,,8
2,3,35,81,1,2,2,2,2,1,2,6
3,6,,18,1,2,2,2,2,1,,8
4,1,22,36,2,2,2,1,2,2,,12

#### convert all to numaric values

In [13]:
def to_numaric(data):
    for i in data.columns:
        data[i] = data[i].convert_objects(convert_numeric=True)

In [15]:
data2.dtypes

marital            int64
age_1st_mar      float64
age                int64
hispanich          int64
indian             int64
asian              int64
black              int64
HAWAIIAN           int64
WHITE              int64
how_mar_ended    float64
edu                int64
dtype: object

## print the frquancy of the values

In [18]:
def distribution(var_data):
    """this function will print out the frequency
    distribution for every variable in the data-frame   """
    #var_data = pd.to_numeric(var_data, errors='ignore')
    print("the count of the values in {}".format(var_data.name))
    print(var_data.value_counts())
    print("the % of every value in the {} variable  ".format(var_data.name))
    print(var_data.value_counts(normalize=True))
    print("-----------------------------------")


def print_dist():
    # this function loops though the variables and print them out
    for i in data2.columns:
        print(distribution(data2[i]))


print_dist()

the count of the values in marital
1    20769
6     9895
4     5401
3     4271
5     1445
2     1312
Name: marital, dtype: int64
the % of every value in the marital variable
1    0.481958
6    0.229620
4    0.125334
3    0.099111
5    0.033532
2    0.030446
Name: marital, dtype: float64
-----------------------------------
None
the count of the values in age_1st_mar
21.0    3473
19.0    2999
18.0    2944
20.0    2889
22.0    2652
23.0    2427
24.0    2071
25.0    2058
26.0    1448
17.0    1249
27.0    1145
28.0    1001
30.0     835
16.0     758
29.0     742
99.0     543
32.0     433
31.0     401
15.0     304
35.0     296
33.0     282
34.0     249
36.0     170
14.0     150
38.0     119
37.0     110
39.0     103
40.0     101
42.0      69
41.0      51
44.0      36
43.0      36
45.0      32
50.0      24
46.0      23
47.0      21
48.0      19
49.0      13
51.0      13
54.0       9
52.0       5
53.0       4
55.0       4
65.0       3
64.0       3
63.0       3
60.0       3
61.0       2
94.0       2
57.0       2
59.0       1
58.0       1
56.0       1
67.0       1
69.0       1
70.0       1
77.0       1
62.0       1
Name: age_1st_mar, dtype: int64
the % of every value in the age_1st_mar variable
21.0    0.107400
19.0    0.092742
18.0    0.091041
20.0    0.089340
22.0    0.082011
23.0    0.075053
24.0    0.064044
25.0    0.063642
26.0    0.044778
17.0    0.038624
27.0    0.035408
28.0    0.030955
30.0    0.025822
16.0    0.023441
29.0    0.022946
99.0    0.016792
32.0    0.013390
31.0    0.012401
15.0    0.009401
35.0    0.009154
33.0    0.008721
34.0    0.007700
36.0    0.005257
14.0    0.004639
38.0    0.003680
37.0    0.003402
39.0    0.003185
40.0    0.003123
42.0    0.002134
41.0    0.001577
44.0    0.001113
43.0    0.001113
45.0    0.000990
50.0    0.000742
46.0    0.000711
47.0    0.000649
48.0    0.000588
49.0    0.000402
51.0    0.000402
54.0    0.000278
52.0    0.000155
53.0    0.000124
55.0    0.000124
65.0    0.000093
64.0    0.000093
63.0    0.000093
60.0    0.000093
61.0    0.000062
94.0    0.000062
57.0    0.000062
59.0    0.000031
58.0    0.000031
56.0    0.000031
67.0    0.000031
69.0    0.000031
70.0    0.000031
77.0    0.000031
62.0    0.000031
Name: age_1st_mar, dtype: float64
-----------------------------------
None
the count of the values in age
40    992
37    991
38    989
39    924
42    912
36    885
41    881
45    878
32    873
30    869
31    861
35    861
33    846
34    843
43    832
44    823
47    810
24    803
46    799
48    789
29    777
21    748
18    746
49    742
54    742
22    734
51    732
23    731
50    729
19    722
     ...
73    432
70    426
71    423
67    423
68    405
72    397
75    384
77    377
76    367
80    324
78    317
79    297
81    262
83    237
82    233
85    175
84    175
87    149
86    139
89     98
88     94
90     76
91     53
92     45
93     26
94     24
95     16
98     14
96     13
97      9
Name: age, dtype: int64
the % of every value in the age variable
40    0.023020
37    0.022997
38    0.022950
39    0.021442
42    0.021164
36    0.020537
41    0.020444
45    0.020375
32    0.020259
30    0.020166
31    0.019980
35    0.019980
33    0.019632
34    0.019562
43    0.019307
44    0.019098
47    0.018797
24    0.018634
46    0.018541
48    0.018309
29    0.018031
21    0.017358
18    0.017311
49    0.017219
54    0.017219
22    0.017033
51    0.016987
23    0.016963
50    0.016917
19    0.016754
        ...
73    0.010025
70    0.009886
71    0.009816
67    0.009816
68    0.009398
72    0.009213
75    0.008911
77    0.008749
76    0.008516
80    0.007519
78    0.007356
79    0.006892
81    0.006080
83    0.005500
82    0.005407
85    0.004061
84    0.004061
87    0.003458
86    0.003226
89    0.002274
88    0.002181
90    0.001764
91    0.001230
92    0.001044
93    0.000603
94    0.000557
95    0.000371
98    0.000325
96    0.000302
97    0.000209
Name: age, dtype: float64
-----------------------------------
None
the count of the values in hispanich
2    34785
1     8308
Name: hispanich, dtype: int64
the % of every value in the hispanich variable
2    0.807208
1    0.192792
Name: hispanich, dtype: float64
-----------------------------------
None
the count of the values in indian
2    41789
1     1304
Name: indian, dtype: int64
the % of every value in the indian variable
2    0.96974
1    0.03026
Name: indian, dtype: float64
-----------------------------------
None
the count of the values in asian
2    41759
1     1334
Name: asian, dtype: int64
the % of every value in the asian variable
2    0.969044
1    0.030956
Name: asian, dtype: float64
-----------------------------------
None
the count of the values in black
2    34493
1     8600
Name: black, dtype: int64
the % of every value in the black variable
2    0.800432
1    0.199568
Name: black, dtype: float64
-----------------------------------
None
the count of the values in HAWAIIAN
2    42730
1      363
Name: HAWAIIAN, dtype: int64
the % of every value in the HAWAIIAN variable
2    0.991576
1    0.008424
Name: HAWAIIAN, dtype: float64
-----------------------------------
None
the count of the values in WHITE
1    32789
2    10304
Name: WHITE, dtype: int64
the % of every value in the WHITE variable
1    0.760889
2    0.239111
Name: WHITE, dtype: float64
-----------------------------------
None
the count of the values in how_mar_ended
2.0    10803
1.0     4025
3.0      201
9.0       98
Name: how_mar_ended, dtype: int64
the % of every value in the how_mar_ended variable
2.0    0.714154
1.0    0.266081
3.0    0.013287
9.0    0.006478
Name: how_mar_ended, dtype: float64
-----------------------------------
None
the count of the values in edu
8     10935
10     8891
12     5251
7      4518
11     3772
14     3257
9      1612
13     1526
6      1210
4       931
3       421
5       414
1       218
2       137
Name: edu, dtype: int64
the % of every value in the edu variable
8     0.253754
10    0.206321
12    0.121853
7     0.104843
11    0.087532
14    0.075581
9     0.037407
13    0.035412
6     0.028079
4     0.021604
3     0.009770
5     0.009607
1     0.005059
2     0.003179
Name: edu, dtype: float64
-----------------------------------
None

## 1- recoding unknown values

from the variable "how_mar_ended" `HOW FIRST MARRIAGE ENDED` will code the `9` value from Unknown to NaN

In [28]:
data2['how_mar_ended'] = data2['how_mar_ended'].replace(9, np.nan)
data2['age_1st_mar'] = data2['age_1st_mar'].replace(99, np.nan)

In [19]:
data2['how_mar_ended'].value_counts(sort=False, dropna=False)

NaN     28064
 1.0     4025
 2.0    10803
 3.0      201
Name: how_mar_ended, dtype: int64

## 2- remaping values

In [26]:

#the first variable is 'marital'
marital_remap_dict = {  1:'Married',
                        2: 'Living with someone as if married',
                        3: 'Widowed',
                        4: 'Divorced',
                        5: 'Separated',
                        6: 'Never Married'
                        
                      }
data2['marital'] =  data2['marital'].map(marital_remap_dict)

#the second value will remap in the education level 
edu_remap_dict = {  1: 'No formal schooling',
                    2: 'K, 1 or 2',
                    3: '3 or 4',
                    4: '5 or 6',
                    5: '7',
                    6: '8',
                    7: '(grades 9-11)',
                    8: 'Completed high school',
                    9: ' degree',
                    10: 'Some college (no degree)',
                    11: 'technical 2-year degree',
                    12: 'bachelor\'s',
                    14: 'master\'s'
                 }
data2['edu'] =  data2['edu'].map(edu_remap_dict)

In [35]:


def ETHNICITY(row):
    if row['hispanich'] == 1:
        return 'hispanich'
    if row['indian'] == 1:
        return 'indian'
    if row['asian'] == 1:
        return 'asian'
    if row['HAWAIIAN'] == 1:
        return 'hawaian'
    if row['WHITE'] == 1:
        return 'white'
    if row['black'] == 1:
        return 'black'


data2['ETHNICITY'] = data2.apply(lambda row: ETHNICITY(row), axis=1)

In [37]:
data2.head(5)

,marital,age_1st_mar,age,hispanich,indian,asian,black,HAWAIIAN,WHITE,how_mar_ended,edu,ETHNICITY
0,NaN,NaN,23,1,2,2,2,2,1,NaN,Completed high school,hispanich
1,NaN,23.0,28,1,2,2,2,2,1,NaN,Completed high school,hispanich
2,NaN,35.0,81,1,2,2,2,2,1,2.0,8,hispanich
3,NaN,NaN,18,1,2,2,2,2,1,NaN,Completed high school,hispanich
4,NaN,22.0,36,2,2,2,1,2,2,NaN,bachelor's,black